BadenMorgan/midea_ac_control_esp32/src/wifi_config.h
#ifdef ESP32
    #include <esp_wifi.h>
    #include <WiFi.h>
    #include <WiFiClient.h>

    // From v1.1.1
    #include <WiFiMulti.h>
    WiFiMulti wifiMulti;

  // LittleFS has higher priority than SPIFFS
#if ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) )
    #define USE_LITTLEFS    true
    #define USE_SPIFFS      false
#elif defined(ARDUINO_ESP32C3_DEV)
    // For core v1.0.6-, ESP32-C3 only supporting SPIFFS and EEPROM. To use v2.0.0+ for LittleFS
    #define USE_LITTLEFS          false
    #define USE_SPIFFS            true
#endif

#if USE_LITTLEFS
    // Use LittleFS
    #include "FS.h"

    // Check cores/esp32/esp_arduino_version.h and cores/esp32/core_version.h
    //#if ( ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(2, 0, 0) )  //(ESP_ARDUINO_VERSION_MAJOR >= 2)
    #if ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) )
        #warning Using ESP32 Core 1.0.6 or 2.0.0+
        // The library has been merged into esp32 core from release 1.0.6
        #include <LittleFS.h>       // https://github.com/espressif/arduino-esp32/tree/master/libraries/LittleFS

        FS* filesystem =      &LittleFS;
        #define FileFS        LittleFS
        #define FS_Name       "LittleFS"
    #else
        #warning Using ESP32 Core 1.0.5-. You must install LITTLEFS library
        // The library has been merged into esp32 core from release 1.0.6
        #include <LITTLEFS.h>       // https://github.com/lorol/LITTLEFS

        FS* filesystem =      &LITTLEFS;
        #define FileFS        LITTLEFS
        #define FS_Name       "LittleFS"
    #endif

#elif USE_SPIFFS
    #include <SPIFFS.h>
    FS* filesystem =      &SPIFFS;
    #define FileFS        SPIFFS
    #define FS_Name       "SPIFFS"
#else
    // +Use FFat
    #include <FFat.h>
    FS* filesystem =      &FFat;
    #define FileFS        FFat
    #define FS_Name       "FFat"
#endif
  //////

    #define ESP_getChipId()   ((uint32_t)ESP.getEfuseMac())

    #define LED_BUILTIN       2
    #define LED_ON            HIGH
    #define LED_OFF           LOW

#else

    #include <ESP8266WiFi.h>          //https://github.com/esp8266/Arduino
    //needed for library
    #include <DNSServer.h>

    // From v1.1.1
    #include <ESP8266WiFiMulti.h>
    ESP8266WiFiMulti wifiMulti;

    #define USE_LITTLEFS      true

#if USE_LITTLEFS
    #include <LittleFS.h>
    FS* filesystem =      &LittleFS;
    #define FileFS        LittleFS
    #define FS_Name       "LittleFS"
#else
    FS* filesystem =      &SPIFFS;
    #define FileFS        SPIFFS
    #define FS_Name       "SPIFFS"
#endif
//////

#define ESP_getChipId()   (ESP.getChipId())

#define LED_ON      LOW
#define LED_OFF     HIGH
#endif

// SSID and PW for Config Portal
String ssid = "ESP_AC_CNTR" + String(ESP_getChipId(), HEX);
const char* password = "";

// SSID and PW for your Router
String Router_SSID;
String Router_Pass;

// From v1.1.0
// You only need to format the filesystem once
//#define FORMAT_FILESYSTEM       true
#define FORMAT_FILESYSTEM         false

#define MIN_AP_PASSWORD_SIZE    8

#define SSID_MAX_LEN            32
//From v1.0.10, WPA2 passwords can be up to 63 characters long.
#define PASS_MAX_LEN            64

typedef struct
{
    char wifi_ssid[SSID_MAX_LEN];
    char wifi_pw  [PASS_MAX_LEN];
}  WiFi_Credentials;

typedef struct
{
    String wifi_ssid;
    String wifi_pw;
}  WiFi_Credentials_String;

#define NUM_WIFI_CREDENTIALS      1

typedef struct
{
    WiFi_Credentials  WiFi_Creds [NUM_WIFI_CREDENTIALS];
} WM_Config;

WM_Config         WM_config;

#define  CONFIG_FILENAME              F("/wifi_cred.dat")
//////

#include <ESPAsync_WiFiManager.h>              //https://github.com/khoih-prog/ESPAsync_WiFiManager

#define HTTP_PORT           80

#define AUTOCONNECT_NO_INVALIDATE     true
#define USE_AVAILABLE_PAGES     true
